{
  "difference_of": "object",
  "different_entries": {
    "ascensions": {
      "entry_difference": "value",
      "value_diff": {
        "difference_of": "object",
        "different_entries": {
          "2": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Topological Singularity": {
                  "entry_difference": "extra"
                },
                "Topological Confinement": {
                  "entry_difference": "missing",
                  "value": 3
                }
              }
            }
          },
          "3": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Topological Singularity": {
                  "entry_difference": "extra"
                },
                "Topological Confinement": {
                  "entry_difference": "missing",
                  "value": 6
                }
              }
            }
          },
          "4": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Topological Singularity": {
                  "entry_difference": "extra"
                },
                "Topological Confinement": {
                  "entry_difference": "missing",
                  "value": 9
                }
              }
            }
          },
          "5": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Topological Singularity": {
                  "entry_difference": "extra"
                },
                "Topological Confinement": {
                  "entry_difference": "missing",
                  "value": 12
                }
              }
            }
          },
          "6": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Topological Singularity": {
                  "entry_difference": "extra"
                },
                "Topological Confinement": {
                  "entry_difference": "missing",
                  "value": 16
                }
              }
            }
          }
        }
      }
    },
    "chains": {
      "entry_difference": "value",
      "value_diff": {
        "difference_of": "object",
        "different_entries": {
          "1": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Desc": {
                  "entry_difference": "value",
                  "value_diff": {
                    "difference_of": "scalar",
                    "source": "Extend the effective range of the Stellarealms generated by Resonance Liberation End Loop by 150%, and increase their duration by 10s.",
                    "target": "The Stellarealms generated by Resonance Liberation End Loop gain the following enhancements: - The effective range of the healing and buffs is extended by 150% - The duration is extended by 10s. - Casting Intro Skill Discernment no longer ends the existing Stellarealm."
                  }
                }
              }
            }
          },
          "2": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Desc": {
                  "entry_difference": "value",
                  "value_diff": {
                    "difference_of": "scalar",
                    "source": "When a Flare Star Butterfly hits a target, Shorekeeper heals herself by 2% of her Max HP. When a Dim Star Butterfly hits a target, all party members gain 3% DMG Bonus for all Attributes. This effect can stack up to 5 times, lasting for 30s.",
                    "target": "The Outer Stellarealm now increases the ATK of all team members by 40%."
                  }
                }
              }
            }
          },
          "3": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Desc": {
                  "entry_difference": "value",
                  "value_diff": {
                    "difference_of": "scalar",
                    "source": "When a party member casts Intro Skill inside a Stellarealm, Shorekeeper gains 20 Concerto Energy. This effect can be triggered once every 25s.",
                    "target": "Casting Resonance Liberation End Loop grants Shorekeeper 20 Concerto Energy. This effect can be triggered once every 25s."
                  }
                }
              }
            }
          },
          "4": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Desc": {
                  "entry_difference": "value",
                  "value_diff": {
                    "difference_of": "scalar",
                    "source": "Casting Outro Skill Binary Butterfly Amplifies all team members' DMG by 10% for 30s.",
                    "target": "Gain 70% additional Healing Bonus when casting Resonance Skill Chaos Theory."
                  }
                }
              }
            }
          },
          "5": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Desc": {
                  "entry_difference": "value",
                  "value_diff": {
                    "difference_of": "scalar",
                    "source": "Extend the effective range of Basic Attack Stage 3 by 50% and Illation by 30%.",
                    "target": "Extend the ranges of the pulling effect of Basic Attack Stage 3 by 50% and Illation by 30%."
                  }
                }
              }
            }
          },
          "6": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Desc": {
                  "entry_difference": "value",
                  "value_diff": {
                    "difference_of": "scalar",
                    "source": "Increase the DMG Multiplier of Intro Skill Discernment by 42%. Casting Intro Skill Discernment increases Shorekeeper's Crit. DMG by 200%.",
                    "target": "Increase the DMG Multiplier of Intro Skill Discernment by 42%. Casting Intro Skill Discernment increases Shorekeeper's Crit. DMG by 500%."
                  }
                }
              }
            }
          }
        }
      }
    },
    "skills": {
      "entry_difference": "value",
      "value_diff": {
        "difference_of": "object",
        "different_entries": {
          "1": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Skill": {
                  "entry_difference": "value",
                  "value_diff": {
                    "difference_of": "object",
                    "different_entries": {
                      "SkillL": {
                        "entry_difference": "value",
                        "value_diff": {
                          "difference_of": "object",
                          "different_entries": {
                            "Desc": {
                              "entry_difference": "value",
                              "value_diff": {
                                "difference_of": "scalar",
                                "source": "Basic Attack: Perform up to 4 consecutive attacks, dealing Spectro DMG. Each hit generates 1 Collapsed Core. Heavy Attack: Hold the Normal Attack Button to enter Unbound Form, which consumes STA continuously. While in this form, Shorekeeper will: - Generate a segment of Speculative Data every second; - Automatically collect nearby plant collectibles.Press the Normal Attack Button or use up all STA to exit Unbound Form and deal Spectro DMG to the target. Each accumulated segment of Speculative Data will convert into a segment of Actual Data and generate a Collapsed Core. Mid-air Attack: Consume STA to perform a Plunging Attack. Each hit generates 1 Collapsed Core. Quickly Press the Normal Attack Button after the Plunging Attack to perform Basic Attack Stage 2. Dodge Counter: Press the Normal Attack Button after a successful Dodge to attack a target, dealing Spectro DMG.",
                                "target": "Basic Attack: Perform up to 4 consecutive attacks, dealing Spectro DMG. Each hit generates 1 Collapsed Core. Heavy Attack: Hold the Normal Attack Button to enter Unbound Form, which consumes STA continuously. While in this form, Shorekeeper will: - Generate a segment of Deductive Data every second; - Automatically collect nearby plant collectibles.Using up all STA or actions such as casting Basic Attack will end the Unbound Form and deal Spectro DMG to the target. Each accumulated segment of Deductive Data will convert into a segment of Empirical Data and generate a Collapsed Core. Mid-air Attack: Consume STA to perform a Plunging Attack. Each hit generates 1 Collapsed Core. Quickly Press the Normal Attack Button after the Plunging Attack to perform Basic Attack Stage 2. Dodge Counter: Press the Normal Attack Button after a successful Dodge to attack a target, dealing Spectro DMG."
                              }
                            },
                            "Level": {
                              "entry_difference": "value",
                              "value_diff": {
                                "difference_of": "object",
                                "different_entries": {
                                  "7": {
                                    "entry_difference": "value",
                                    "value_diff": {
                                      "difference_of": "object",
                                      "different_entries": {
                                        "Format": {
                                          "entry_difference": "value",
                                          "value_diff": {
                                            "difference_of": "scalar",
                                            "source": "[44.00%*3|87.48%*3]",
                                            "target": "[44.00%*2|87.48%*2]"
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          },
          "2": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Skill": {
                  "entry_difference": "value",
                  "value_diff": {
                    "difference_of": "object",
                    "different_entries": {
                      "SkillL": {
                        "entry_difference": "value",
                        "value_diff": {
                          "difference_of": "object",
                          "different_entries": {
                            "Damage": {
                              "entry_difference": "value",
                              "value_diff": {
                                "difference_of": "object",
                                "different_entries": {
                                  "1505600001": {
                                    "entry_difference": "value",
                                    "value_diff": {
                                      "difference_of": "object",
                                      "different_entries": {
                                        "Type": {
                                          "entry_difference": "value",
                                          "value_diff": {
                                            "difference_of": "scalar",
                                            "source": 0,
                                            "target": 4
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "Desc": {
                              "entry_difference": "value",
                              "value_diff": {
                                "difference_of": "scalar",
                                "source": "Restore HP for all nearby party members and summon 5 Dim Star Butterflies, which automatically track and attack a target, dealing Spectro DMG.It can be performed in mid-air.",
                                "target": "Restore HP for all nearby party members and summon 5 Dim Star Butterflies, which automatically track and attack a target, dealing Spectro DMG. Follow up with Basic Attack in time to start the Basic Attack cycle from Stage 2.Can be performed in mid-air."
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          },
          "3": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Skill": {
                  "entry_difference": "value",
                  "value_diff": {
                    "difference_of": "object",
                    "different_entries": {
                      "SkillL": {
                        "entry_difference": "value",
                        "value_diff": {
                          "difference_of": "object",
                          "different_entries": {
                            "Desc": {
                              "entry_difference": "value",
                              "value_diff": {
                                "difference_of": "scalar",
                                "source": "Outer Stellarealm: Generate the Outer Stellarealm to restore HP for all party members inside it continuously. This effect can be triggered once every 3s. Inner Stellarealm: When a party member uses Intro Skill within the Outer Stellarealm, it evolves into the Inner Stellarealm. Inside the Inner Stellarealm, for every 20% of Shorekeeper's Energy Regen, all party members gain a 1% increase of Crit. Rate, up to a maximum of 10%. Inner Stellarealm has all the effects of the Outer Stellarealm. Supernal Stellarealm: When a party member uses Intro Skill within the Inner Stellarealm, it evolves into the Supernal Stellarealm. Inside the Supernal Stellarealm, for every 10% of Shorekeeper's Energy Regen, all party members gain a 1% increase of Crit. Rate, up to a maximum of 20%. Supernal Stellarealm has all the effects of the Inner Stellarealm.When the Supernal Stellarealm exists, Shorekeeper's Intro Skill Enlightenment will be replaced by Intro Skill Discernment.",
                                "target": "Outer Stellarealm: Generate the Outer Stellarealm to restore HP for all party members within its effective range continuously. This effect can be triggered once every 3s. Inner Stellarealm: When a party member uses Intro Skill within the Outer Stellarealm, it evolves into the Inner Stellarealm. Within the effective range of the Inner Stellarealm, for every 0.2% of Shorekeeper's Energy Regen, all party members gain 0.01% bonus Crit. Rate, up to 12.5%. Inner Stellarealm has all the effects of the Outer Stellarealm. Supernal Stellarealm: When a party member uses Intro Skill within the Inner Stellarealm, it evolves into the Supernal Stellarealm. Within the effective range of the Supernal Stellarealm, for every 0.1% of Shorekeeper's Energy Regen, all party members gain a 0.01% increase of Crit. DMG, up to 25%. Supernal Stellarealm has all the effects of the Inner Stellarealm.When Supernal Stellarealm is generated, Shorekeeper's first Intro Skill triggered in its duration will be replaced with Intro Skill Discernment. This effect takes place once each time a Supernal Stellarealm is generated."
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          },
          "4": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Skill": {
                  "entry_difference": "value",
                  "value_diff": {
                    "difference_of": "object",
                    "different_entries": {
                      "SkillL": {
                        "entry_difference": "value",
                        "value_diff": {
                          "difference_of": "object",
                          "different_entries": {
                            "Desc": {
                              "entry_difference": "value",
                              "value_diff": {
                                "difference_of": "scalar",
                                "source": "When a team member other than Shorekeeper takes a fatal damage, they will not be defeated but instead receive 50% of Shorekeeper's HP, with Shorekeeper losing the same amount of HP. This effect can be triggered once every 10 minutes.",
                                "target": "When a Resonator other than Shorekeeper takes a fatal blow, they will not be knocked out and will instead be healed for 50% of Shorekeeper's HP while Shorekeeper loses the same amount of HP. Shorekeeper's HP will not go below 1 from this effect. This effect can be triggered once every 10 minutes."
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          },
          "5": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Skill": {
                  "entry_difference": "value",
                  "value_diff": {
                    "difference_of": "object",
                    "different_entries": {
                      "SkillL": {
                        "entry_difference": "value",
                        "value_diff": {
                          "difference_of": "object",
                          "different_entries": {
                            "Desc": {
                              "entry_difference": "value",
                              "value_diff": {
                                "difference_of": "scalar",
                                "source": "When the active Resonator is inside a Stellarealm, Shorekeeper's Energy Regen increases by 10%. If Rover is on the same team, Rover's Energy Regen also increases by 10%.",
                                "target": "When the Resonator on the field is within the effective range of a Stellarealm, Shorekeeper's Energy Regen increases by 10%. If Rover is on the same team, Rover's Energy Regen also increases by 10%."
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          },
          "6": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Skill": {
                  "entry_difference": "value",
                  "value_diff": {
                    "difference_of": "object",
                    "different_entries": {
                      "SkillL": {
                        "entry_difference": "value",
                        "value_diff": {
                          "difference_of": "object",
                          "different_entries": {
                            "Damage": {
                              "entry_difference": "value",
                              "value_diff": {
                                "difference_of": "object",
                                "different_entries": {
                                  "1505505002": {
                                    "entry_difference": "value",
                                    "value_diff": {
                                      "difference_of": "object",
                                      "different_entries": {
                                        "RateLv": {
                                          "entry_difference": "value",
                                          "value_diff": {
                                            "difference_of": "scalar",
                                            "source": "[15.75|31.31]%",
                                            "target": "[22.79|45.3]%"
                                          }
                                        },
                                        "ToughLv": {
                                          "entry_difference": "value",
                                          "value_diff": {
                                            "difference_of": "scalar",
                                            "source": 4000,
                                            "target": 2848
                                          }
                                        },
                                        "Type": {
                                          "entry_difference": "value",
                                          "value_diff": {
                                            "difference_of": "scalar",
                                            "source": 4,
                                            "target": 3
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "Desc": {
                              "entry_difference": "value",
                              "value_diff": {
                                "difference_of": "scalar",
                                "source": "Enlightenment: Shorekeeper appears to restore HP for all nearby party members and summon 5 Dim Star Butterflies, which automatically track and attack a target, dealing Spectro DMG. This is considered Resonance Skill DMG. Discernment: When the Released Stellarealm is active, Shorekeeper's Intro Skill Enlightenment is replaced by Intro Skill Discernment. Casting Discernment ends the current Stellarealm, restores HP for all nearby party members, and deals Spectro DMG to the targets. This attack is guaranteed to be a Critical Hit dealing Resonance Liberation DMG.",
                                "target": "Enlightenment: Shorekeeper appears to restore HP for all nearby party members and summon 5 Dim Star Butterflies, which automatically track and attack a target, dealing Spectro DMG. This is considered Resonance Skill DMG. Discernment: When the Supernal Stellarealm is active, Shorekeeper's first Intro Skill will be replaced with Intro Skill Discernment. Casting Discernment ends the current Stellarealm, restores HP for all nearby party members, and deals Spectro DMG to the targets. This attack is guaranteed to be a Critical Hit dealing Resonance Liberation DMG. The Intro Skill Discernment can only be cast one time for each Supernal Stellarealm generated."
                              }
                            },
                            "Level": {
                              "entry_difference": "value",
                              "value_diff": {
                                "difference_of": "object",
                                "different_entries": {
                                  "1": {
                                    "entry_difference": "value",
                                    "value_diff": {
                                      "difference_of": "object",
                                      "different_entries": {
                                        "Format": {
                                          "entry_difference": "value",
                                          "value_diff": {
                                            "difference_of": "scalar",
                                            "source": "[15.75%*5|31.31%*5]",
                                            "target": "[22.79%*5|45.30%*5]"
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          },
          "7": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Skill": {
                  "entry_difference": "value",
                  "value_diff": {
                    "difference_of": "object",
                    "different_entries": {
                      "SkillL": {
                        "entry_difference": "value",
                        "value_diff": {
                          "difference_of": "object",
                          "different_entries": {
                            "Desc": {
                              "entry_difference": "value",
                              "value_diff": {
                                "difference_of": "scalar",
                                "source": "Flare Star Butterfly: Hitting a target with a Normal Attack generates a Collapsed Core, which transforms into a Flare Star Butterfly after 6s. Flare Star Butterflies automatically track and attack a target, dealing Spectro DMG. If there are already 5 Collapsed Cores, Shorekeeper's next Normal Attack hit will instantly convert a Collapsed Core into a Flare Star Butterfly. Illation: When Shorekeeper has 5 segments of Actual Data, casting Heavy Attack will consume all segments to pull in nearby targets, dealing Spectro DMG. Meanwhile, all generated Collapsed Cores will instantly transform into Flare Star Butterflies. Transmutation: When Shorekeeper has 5 segments of Actual Data, casting Mid-air Attack will consume all segments to deal Spectro DMG. Meanwhile, all generated Collapsed Cores will instantly transform into Flare Star Butterflies. Quickly press the Normal Attack Button afterward to perform Basic Attack Stage 2. Actual Data: Shorekeeper can hold up to 5 segments of Actual Data.Shorekeeper obtains 1 segment of Actual Data when her Normal Attack Origin Calculus hits a target.",
                                "target": "Flare Star Butterfly: Hitting a target with a Normal Attack generates a Collapsed Core, which transforms into a Flare Star Butterfly after 6s. Flare Star Butterflies automatically track and attack a target, dealing Spectro DMG. If there are already 5 Collapsed Cores, Shorekeeper's next Normal Attack hit will instantly convert a Collapsed Core into a Flare Star Butterfly. Illation: When Shorekeeper has 5 segments of Empirical Data, casting Heavy Attack will consume all segments to pull in nearby targets, dealing Spectro DMG. Meanwhile, all generated Collapsed Cores will instantly transform into Flare Star Butterflies. Transmutation: When Shorekeeper has 5 segments of Empirical Data, casting Mid-air Attack will consume all segments to deal Spectro DMG. Meanwhile, all generated Collapsed Cores will instantly transform into Flare Star Butterflies. Quickly press the Normal Attack Button afterward to perform Basic Attack Stage 2. Empirical Data: Shorekeeper can hold up to 5 segments of Empirical Data. - Obtain 1 segment of Empirical Data when Basic Attack Stage 1, 2, or 4 hits a target. - Obtain 2 segments of Empirical Data when Basic Attack Stage 3 hits a target. - Obtain 1 segment of Empirical Data when Mid-air Attack hits a target. - Obtain 1 segment of Empirical Data when Dodge Counter hits a target."
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          },
          "8": {
            "entry_difference": "value",
            "value_diff": {
              "difference_of": "object",
              "different_entries": {
                "Skill": {
                  "entry_difference": "value",
                  "value_diff": {
                    "difference_of": "object",
                    "different_entries": {
                      "SkillL": {
                        "entry_difference": "value",
                        "value_diff": {
                          "difference_of": "object",
                          "different_entries": {
                            "Desc": {
                              "entry_difference": "value",
                              "value_diff": {
                                "difference_of": "scalar",
                                "source": "Shorekeeper summons 1 Flare Star Butterfly and 1 Dim Star Butterfly to circle the active Resonator for up to 30s.When the Flare Star Butterfly is present, tapping the Dodge Button allows the active Resonator being hit or juggled to be freed from the interruption, which will be considered as a successful Dodge. If the Resonator is in mid-air, they will land on the ground. This effect can be triggered up to 5 time(s).When the Dim Star Butterfly is present, all nearby party members' DMG is Amplified by 15%.",
                                "target": "Shorekeeper summons 1 Flare Star Butterfly and 1 Dim Star Butterfly to circle the Resonator on the field for up to 30s, granting the following effects:   - If the Resonator on the field is hit or launched, tapping the Dodge Button allows the Resonator to immediately recover from the interruption, triggering a successful Dodge. The Resonator launched in the air can land on the ground standing if they are close to the ground. This effect can be triggered up to 5 time(s). - All nearby party members' DMG is Amplified by 15%."
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}